In [1]:
import pandas as pd
import os

### table

In [2]:
schema = ['AAAAA', 'AAAAA', 'AAAAA', 'BBB', 'BBB', 'CC']
name = ['jZyfh', 'pK245', 't0eDj', 'UnlR2', 'Xw4ID', '8ca5S']
dictname = {'Table Owner': schema, 'Table Name': name}

table = pd.DataFrame(dictname)
table

  Table Owner Table Name
0       AAAAA      jZyfh
1       AAAAA      pK245
2       AAAAA      t0eDj
3         BBB      UnlR2
4         BBB      Xw4ID
5          CC      8ca5S

### read txt

*with open(..., encoding = 'MS950') as f:*

In [3]:
with open('/content/drive/MyDrive/testtxt.txt', 'r') as f:
  content = f.read()

print(type(content), '\n')
print(content)

<class 'str'>

--測試: TABLE_OWNER = 'SCHEMA_0' AND TABLE_NAME = 'TABLE_0' (input any owner & name)
--1.concat with ;
--2.test
--3.test

SELECT *
FROM
(
WITH xfile AS(
    SELECT A.*, B.col, ...
    FROM
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...,EXTRACTVALUE --*!!!*--
      ( ABC.col
        ( 'select txtxt
           from txtxt where table_name = ''' || T.col || ''' & col = ''' || T.col || ''''), --*!!!*--
        '//text()' ) AS col
    FROM  ABC.col T
    WHERE TABLE_OWNER = 'SCHEMA_0' AND TABLE_NAME = 'TABLE_0' --*****<<<*****--
    AND col like 'txtxt%'
    ORDER BY col
    ) A,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,col
    FROM  ABC.col
    WHERE TABLE_OWNER = 'SCHEMA_0' AND TABLE_NAME = 'TABLE_0' --*****<<<*****--
    AND (col like '%txtxt%')
    ) B,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...
    FROM  ABC.col
    WHERE TABLE_OWNER = 'SCHEMA_0' AND TABLE_NAME = 'TABLE_0' --*****<<<*****--
    GROUP BY TABLE_OWNER,TABLE_NAME
    ) C,
    (
        SELECT A.OWNER AS TABLE_OWNER,A.TABLE_NAME,...
        FROM
        (
                SELECT OWNER,NAME AS TABLE_NAME,COL_NAME AS col
                FROM xfile
                WHERE col = 'txtxt'
        ) A,
        (
                SELECT OWNER,TABLE_NAME,COL_NAME,...
                FROM xfile
        ) B
        WHERE A.OWNER = B.OWNER
          AND A.TABLE_NAME = B.TABLE_NAME
          AND ...
    ) D
    WHERE A.TABLE_OWNER = B.TABLE_OWNER(+)
      AND A.TABLE_NAME = B.TABLE_NAME(+)
      AND A.TABLE_OWNER = C.TABLE_OWNER(+)
      ...

)
    SELECT col
    FROM
    (
        SELECT '1' AS COL,'--/****** ' || col ||'.'|| col || '******/' AS col
        FROM xfile
        WHERE ROWNUM=1
        UNION ALL
        SELECT '2' AS COL,'--txtxt' FROM DUAL
        UNION ALL
        SELECT '3' AS COL,'txtxt' || col || '.' || col || 'txtxt < (' || 'txtxt' || ');' AS col --*!!!*--
        FROM xfile
        WHERE MAX_col NOT LIKE '%txtxt%'
        AND ROWNUM=1
        UNION ALL
        ...
    )
    ORDER BY col
)
UNION ALL
SELECT  CHR(123) || CHR(456) FROM DUAL
UNION ALL
SELECT  '--txtxt' FROM DUAL
UNION ALL
SELECT  'txtxt' || A.TABLE_OWNER || '.' || A.INDEX_NAME || 'txtxt' || ';' AS col --*!!!*--
FROM
(
SELECT A.TABLE_OWNER,A.INDEX_NAME,B.col,
CASE WHEN A.col IS NULL THEN B.col ELSE A.col END AS col
FROM ABC.col A, ABC.COL B
WHERE A.TABLE_OWNER=B.INDEX_OWNER(+) AND A.INDEX_NAME=B.INDEX_NAME(+)
AND A.OWNER = 'SCHEMA_0' AND A.TABLE_NAME = 'TABLE_0' --*****<<<*****--
AND B.col like 'txtxt%'
ORDER BY col
) A

### str tpl

In [4]:
tpl = content.replace('SCHEMA_0', '{0}').replace('TABLE_0', '{1}')
print(tpl)

--測試: TABLE_OWNER = '{0}' AND TABLE_NAME = '{1}' (input any owner & name)
--1.concat with ;
--2.test
--3.test

SELECT *
FROM
(
WITH xfile AS(
    SELECT A.*, B.col, ...
    FROM
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...,EXTRACTVALUE --*!!!*--
      ( ABC.col
        ( 'select txtxt
           from txtxt where table_name = ''' || T.col || ''' & col = ''' || T.col || ''''), --*!!!*--
        '//text()' ) AS col
    FROM  ABC.col T
    WHERE TABLE_OWNER = '{0}' AND TABLE_NAME = '{1}' --*****<<<*****--
    AND col like 'txtxt%'
    ORDER BY col
    ) A,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,col
    FROM  ABC.col
    WHERE TABLE_OWNER = '{0}' AND TABLE_NAME = '{1}' --*****<<<*****--
    AND (col like '%txtxt%')
    ) B,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...
    FROM  ABC.col
    WHERE TABLE_OWNER = '{0}' AND TABLE_NAME = '{1}' --*****<<<*****--
    GROUP BY TABLE_OWNER,TABLE_NAME
    ) C,
    (
        SELECT A.OWNER AS TABLE_OWNER,A.TABLE_NAME,...
        FROM
        (
                SELECT OWNER,NAME AS TABLE_NAME,COL_NAME AS col
                FROM xfile
                WHERE col = 'txtxt'
        ) A,
        (
                SELECT OWNER,TABLE_NAME,COL_NAME,...
                FROM xfile
        ) B
        WHERE A.OWNER = B.OWNER
          AND A.TABLE_NAME = B.TABLE_NAME
          AND ...
    ) D
    WHERE A.TABLE_OWNER = B.TABLE_OWNER(+)
      AND A.TABLE_NAME = B.TABLE_NAME(+)
      AND A.TABLE_OWNER = C.TABLE_OWNER(+)
      ...

)
    SELECT col
    FROM
    (
        SELECT '1' AS COL,'--/****** ' || col ||'.'|| col || '******/' AS col
        FROM xfile
        WHERE ROWNUM=1
        UNION ALL
        SELECT '2' AS COL,'--txtxt' FROM DUAL
        UNION ALL
        SELECT '3' AS COL,'txtxt' || col || '.' || col || 'txtxt < (' || 'txtxt' || ');' AS col --*!!!*--
        FROM xfile
        WHERE MAX_col NOT LIKE '%txtxt%'
        AND ROWNUM=1
        UNION ALL
        ...
    )
    ORDER BY col
)
UNION ALL
SELECT  CHR(123) || CHR(456) FROM DUAL
UNION ALL
SELECT  '--txtxt' FROM DUAL
UNION ALL
SELECT  'txtxt' || A.TABLE_OWNER || '.' || A.INDEX_NAME || 'txtxt' || ';' AS col --*!!!*--
FROM
(
SELECT A.TABLE_OWNER,A.INDEX_NAME,B.col,
CASE WHEN A.col IS NULL THEN B.col ELSE A.col END AS col
FROM ABC.col A, ABC.COL B
WHERE A.TABLE_OWNER=B.INDEX_OWNER(+) AND A.INDEX_NAME=B.INDEX_NAME(+)
AND A.OWNER = '{0}' AND A.TABLE_NAME = '{1}' --*****<<<*****--
AND B.col like 'txtxt%'
ORDER BY col
) A

### *

*array & def*

In [5]:
table.values

array([['AAAAA', 'jZyfh'],
       ['AAAAA', 'pK245'],
       ['AAAAA', 't0eDj'],
       ['BBB', 'UnlR2'],
       ['BBB', 'Xw4ID'],
       ['CC', '8ca5S']], dtype=object)

In [6]:
table.values[0] # the 0th OBJECT of the array(table.values)

array(['AAAAA', 'jZyfh'], dtype=object)

In [7]:
print(table.values[0][0], table.values[0][1])

AAAAA jZyfh

In [8]:
def zz(r):
  return tpl.format(table.values[r][0], table.values[r][1])
zz(0)

"--測試: TABLE_OWNER = 'AAAAA' AND TABLE_NAME = 'jZyfh' (input any owner & name)\n--1.concat with ;\n--2.test\n--3.test\n\nSELECT *\nFROM\n(\nWITH xfile AS(\n    SELECT A.*, B.col, ...\n    FROM\n    (\n    SELECT  TABLE_OWNER,TABLE_NAME,...,EXTRACTVALUE --*!!!*--\n      ( ABC.col\n        ( 'select txtxt\n           from txtxt where table_name = ''' || T.col || ''' & col = ''' || T.col || ''''), --*!!!*--\n        '//text()' ) AS col\n    FROM  ABC.col T\n    WHERE TABLE_OWNER = 'AAAAA' AND TABLE_NAME = 'jZyfh' --*****<<<*****--\n    AND col like 'txtxt%'\n    ORDER BY col\n    ) A,\n    ( \n    SELECT  TABLE_OWNER,TABLE_NAME,col\n    FROM  ABC.col\n    WHERE TABLE_OWNER = 'AAAAA' AND TABLE_NAME = 'jZyfh' --*****<<<*****--\n    AND (col like '%txtxt%')    \n    ) B,\n    ( \n    SELECT  TABLE_OWNER,TABLE_NAME,...\n    FROM  ABC.col\n    WHERE TABLE_OWNER = 'AAAAA' AND TABLE_NAME = 'jZyfh' --*****<<<*****--\n    GROUP BY TABLE_OWNER,TABLE_NAME\n    ) C,\n    (\n        SELECT A.OWNER AS TABLE_OWNER,A.TABLE_NAME,...\n        FROM\n        (        \n                SELECT OWNER,NAME AS TABLE_NAME,COL_NAME AS col\n                FROM xfile\n                WHERE col = 'txtxt'\n        ) A,\n        ( \n                SELECT OWNER,TABLE_NAME,COL_NAME,...\n                FROM xfile\n        ) B\n        WHERE A.OWNER = B.OWNER\n          AND A.TABLE_NAME = B.TABLE_NAME \n          AND ...\n    ) D\n    WHERE A.TABLE_OWNER = B.TABLE_OWNER(+)\n      AND A.TABLE_NAME = B.TABLE_NAME(+)\n      AND A.TABLE_OWNER = C.TABLE_OWNER(+)\n      ...\n     \n)   \n    SELECT col\n    FROM\n    (\n        SELECT '1' AS COL,'--/****** ' || col ||'.'|| col || '******/' AS col\n        FROM xfile\n        WHERE ROWNUM=1\n        UNION ALL\n        SELECT '2' AS COL,'--txtxt' FROM DUAL\n        UNION ALL         \n        SELECT '3' AS COL,'txtxt' || col || '.' || col || 'txtxt < (' || 'txtxt' || ');' AS col --*!!!*--\n        FROM xfile\n        WHERE MAX_col NOT LIKE '%txtxt%'\n        AND ROWNUM=1\n        UNION ALL\n        ...\n    )\n    ORDER BY col\n)\nUNION ALL\nSELECT  CHR(123) || CHR(456) FROM DUAL\nUNION ALL\nSELECT  '--txtxt' FROM DUAL\nUNION ALL\nSELECT  'txtxt' || A.TABLE_OWNER || '.' || A.INDEX_NAME || 'txtxt' || ';' AS col --*!!!*--\nFROM\n(\nSELECT A.TABLE_OWNER,A.INDEX_NAME,B.col,\nCASE WHEN A.col IS NULL THEN B.col ELSE A.col END AS col\nFROM ABC.col A, ABC.COL B\nWHERE A.TABLE_OWNER=B.INDEX_OWNER(+) AND A.INDEX_NAME=B.INDEX_NAME(+)\nAND A.OWNER = 'AAAAA' AND A.TABLE_NAME = 'jZyfh' --*****<<<*****--\nAND B.col like 'txtxt%'\nORDER BY col\n) A"

dir

In [9]:
os.getcwd()

'/content'

In [10]:
os.chdir('/content/drive')

In [11]:
os.getcwd()

'/content/drive'

### write

*table 3 - the last one, concat with ; as a txt*

In [12]:
with open('/content/drive/MyDrive/output.txt', 'w') as f:
  for i in table.values[2:]:
    tmp = tpl.format(i[0], i[1])
    print('now doing: ' + i[0] + ', ' + i[1])
    f.write('%s;\n\n' % tmp)

now doing: AAAAA, t0eDj
now doing: BBB, UnlR2
now doing: BBB, Xw4ID
now doing: CC, 8ca5S

### output

In [13]:
with open('/content/drive/MyDrive/output.txt', 'r') as f:
    print(f.read())

--測試: TABLE_OWNER = 'AAAAA' AND TABLE_NAME = 't0eDj' (input any owner & name)
--1.concat with ;
--2.test
--3.test

SELECT *
FROM
(
WITH xfile AS(
    SELECT A.*, B.col, ...
    FROM
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...,EXTRACTVALUE --*!!!*--
      ( ABC.col
        ( 'select txtxt
           from txtxt where table_name = ''' || T.col || ''' & col = ''' || T.col || ''''), --*!!!*--
        '//text()' ) AS col
    FROM  ABC.col T
    WHERE TABLE_OWNER = 'AAAAA' AND TABLE_NAME = 't0eDj' --*****<<<*****--
    AND col like 'txtxt%'
    ORDER BY col
    ) A,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,col
    FROM  ABC.col
    WHERE TABLE_OWNER = 'AAAAA' AND TABLE_NAME = 't0eDj' --*****<<<*****--
    AND (col like '%txtxt%')
    ) B,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...
    FROM  ABC.col
    WHERE TABLE_OWNER = 'AAAAA' AND TABLE_NAME = 't0eDj' --*****<<<*****--
    GROUP BY TABLE_OWNER,TABLE_NAME
    ) C,
    (
        SELECT A.OWNER AS TABLE_OWNER,A.TABLE_NAME,...
        FROM
        (
                SELECT OWNER,NAME AS TABLE_NAME,COL_NAME AS col
                FROM xfile
                WHERE col = 'txtxt'
        ) A,
        (
                SELECT OWNER,TABLE_NAME,COL_NAME,...
                FROM xfile
        ) B
        WHERE A.OWNER = B.OWNER
          AND A.TABLE_NAME = B.TABLE_NAME
          AND ...
    ) D
    WHERE A.TABLE_OWNER = B.TABLE_OWNER(+)
      AND A.TABLE_NAME = B.TABLE_NAME(+)
      AND A.TABLE_OWNER = C.TABLE_OWNER(+)
      ...

)
    SELECT col
    FROM
    (
        SELECT '1' AS COL,'--/****** ' || col ||'.'|| col || '******/' AS col
        FROM xfile
        WHERE ROWNUM=1
        UNION ALL
        SELECT '2' AS COL,'--txtxt' FROM DUAL
        UNION ALL
        SELECT '3' AS COL,'txtxt' || col || '.' || col || 'txtxt < (' || 'txtxt' || ');' AS col --*!!!*--
        FROM xfile
        WHERE MAX_col NOT LIKE '%txtxt%'
        AND ROWNUM=1
        UNION ALL
        ...
    )
    ORDER BY col
)
UNION ALL
SELECT  CHR(123) || CHR(456) FROM DUAL
UNION ALL
SELECT  '--txtxt' FROM DUAL
UNION ALL
SELECT  'txtxt' || A.TABLE_OWNER || '.' || A.INDEX_NAME || 'txtxt' || ';' AS col --*!!!*--
FROM
(
SELECT A.TABLE_OWNER,A.INDEX_NAME,B.col,
CASE WHEN A.col IS NULL THEN B.col ELSE A.col END AS col
FROM ABC.col A, ABC.COL B
WHERE A.TABLE_OWNER=B.INDEX_OWNER(+) AND A.INDEX_NAME=B.INDEX_NAME(+)
AND A.OWNER = 'AAAAA' AND A.TABLE_NAME = 't0eDj' --*****<<<*****--
AND B.col like 'txtxt%'
ORDER BY col
) A;

--測試: TABLE_OWNER = 'BBB' AND TABLE_NAME = 'UnlR2' (input any owner & name)
--1.concat with ;
--2.test
--3.test

SELECT *
FROM
(
WITH xfile AS(
    SELECT A.*, B.col, ...
    FROM
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...,EXTRACTVALUE --*!!!*--
      ( ABC.col
        ( 'select txtxt
           from txtxt where table_name = ''' || T.col || ''' & col = ''' || T.col || ''''), --*!!!*--
        '//text()' ) AS col
    FROM  ABC.col T
    WHERE TABLE_OWNER = 'BBB' AND TABLE_NAME = 'UnlR2' --*****<<<*****--
    AND col like 'txtxt%'
    ORDER BY col
    ) A,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,col
    FROM  ABC.col
    WHERE TABLE_OWNER = 'BBB' AND TABLE_NAME = 'UnlR2' --*****<<<*****--
    AND (col like '%txtxt%')
    ) B,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...
    FROM  ABC.col
    WHERE TABLE_OWNER = 'BBB' AND TABLE_NAME = 'UnlR2' --*****<<<*****--
    GROUP BY TABLE_OWNER,TABLE_NAME
    ) C,
    (
        SELECT A.OWNER AS TABLE_OWNER,A.TABLE_NAME,...
        FROM
        (
                SELECT OWNER,NAME AS TABLE_NAME,COL_NAME AS col
                FROM xfile
                WHERE col = 'txtxt'
        ) A,
        (
                SELECT OWNER,TABLE_NAME,COL_NAME,...
                FROM xfile
        ) B
        WHERE A.OWNER = B.OWNER
          AND A.TABLE_NAME = B.TABLE_NAME
          AND ...
    ) D
    WHERE A.TABLE_OWNER = B.TABLE_OWNER(+)
      AND A.TABLE_NAME = B.TABLE_NAME(+)
      AND A.TABLE_OWNER = C.TABLE_OWNER(+)
      ...

)
    SELECT col
    FROM
    (
        SELECT '1' AS COL,'--/****** ' || col ||'.'|| col || '******/' AS col
        FROM xfile
        WHERE ROWNUM=1
        UNION ALL
        SELECT '2' AS COL,'--txtxt' FROM DUAL
        UNION ALL
        SELECT '3' AS COL,'txtxt' || col || '.' || col || 'txtxt < (' || 'txtxt' || ');' AS col --*!!!*--
        FROM xfile
        WHERE MAX_col NOT LIKE '%txtxt%'
        AND ROWNUM=1
        UNION ALL
        ...
    )
    ORDER BY col
)
UNION ALL
SELECT  CHR(123) || CHR(456) FROM DUAL
UNION ALL
SELECT  '--txtxt' FROM DUAL
UNION ALL
SELECT  'txtxt' || A.TABLE_OWNER || '.' || A.INDEX_NAME || 'txtxt' || ';' AS col --*!!!*--
FROM
(
SELECT A.TABLE_OWNER,A.INDEX_NAME,B.col,
CASE WHEN A.col IS NULL THEN B.col ELSE A.col END AS col
FROM ABC.col A, ABC.COL B
WHERE A.TABLE_OWNER=B.INDEX_OWNER(+) AND A.INDEX_NAME=B.INDEX_NAME(+)
AND A.OWNER = 'BBB' AND A.TABLE_NAME = 'UnlR2' --*****<<<*****--
AND B.col like 'txtxt%'
ORDER BY col
) A;

--測試: TABLE_OWNER = 'BBB' AND TABLE_NAME = 'Xw4ID' (input any owner & name)
--1.concat with ;
--2.test
--3.test

SELECT *
FROM
(
WITH xfile AS(
    SELECT A.*, B.col, ...
    FROM
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...,EXTRACTVALUE --*!!!*--
      ( ABC.col
        ( 'select txtxt
           from txtxt where table_name = ''' || T.col || ''' & col = ''' || T.col || ''''), --*!!!*--
        '//text()' ) AS col
    FROM  ABC.col T
    WHERE TABLE_OWNER = 'BBB' AND TABLE_NAME = 'Xw4ID' --*****<<<*****--
    AND col like 'txtxt%'
    ORDER BY col
    ) A,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,col
    FROM  ABC.col
    WHERE TABLE_OWNER = 'BBB' AND TABLE_NAME = 'Xw4ID' --*****<<<*****--
    AND (col like '%txtxt%')
    ) B,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...
    FROM  ABC.col
    WHERE TABLE_OWNER = 'BBB' AND TABLE_NAME = 'Xw4ID' --*****<<<*****--
    GROUP BY TABLE_OWNER,TABLE_NAME
    ) C,
    (
        SELECT A.OWNER AS TABLE_OWNER,A.TABLE_NAME,...
        FROM
        (
                SELECT OWNER,NAME AS TABLE_NAME,COL_NAME AS col
                FROM xfile
                WHERE col = 'txtxt'
        ) A,
        (
                SELECT OWNER,TABLE_NAME,COL_NAME,...
                FROM xfile
        ) B
        WHERE A.OWNER = B.OWNER
          AND A.TABLE_NAME = B.TABLE_NAME
          AND ...
    ) D
    WHERE A.TABLE_OWNER = B.TABLE_OWNER(+)
      AND A.TABLE_NAME = B.TABLE_NAME(+)
      AND A.TABLE_OWNER = C.TABLE_OWNER(+)
      ...

)
    SELECT col
    FROM
    (
        SELECT '1' AS COL,'--/****** ' || col ||'.'|| col || '******/' AS col
        FROM xfile
        WHERE ROWNUM=1
        UNION ALL
        SELECT '2' AS COL,'--txtxt' FROM DUAL
        UNION ALL
        SELECT '3' AS COL,'txtxt' || col || '.' || col || 'txtxt < (' || 'txtxt' || ');' AS col --*!!!*--
        FROM xfile
        WHERE MAX_col NOT LIKE '%txtxt%'
        AND ROWNUM=1
        UNION ALL
        ...
    )
    ORDER BY col
)
UNION ALL
SELECT  CHR(123) || CHR(456) FROM DUAL
UNION ALL
SELECT  '--txtxt' FROM DUAL
UNION ALL
SELECT  'txtxt' || A.TABLE_OWNER || '.' || A.INDEX_NAME || 'txtxt' || ';' AS col --*!!!*--
FROM
(
SELECT A.TABLE_OWNER,A.INDEX_NAME,B.col,
CASE WHEN A.col IS NULL THEN B.col ELSE A.col END AS col
FROM ABC.col A, ABC.COL B
WHERE A.TABLE_OWNER=B.INDEX_OWNER(+) AND A.INDEX_NAME=B.INDEX_NAME(+)
AND A.OWNER = 'BBB' AND A.TABLE_NAME = 'Xw4ID' --*****<<<*****--
AND B.col like 'txtxt%'
ORDER BY col
) A;

--測試: TABLE_OWNER = 'CC' AND TABLE_NAME = '8ca5S' (input any owner & name)
--1.concat with ;
--2.test
--3.test

SELECT *
FROM
(
WITH xfile AS(
    SELECT A.*, B.col, ...
    FROM
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...,EXTRACTVALUE --*!!!*--
      ( ABC.col
        ( 'select txtxt
           from txtxt where table_name = ''' || T.col || ''' & col = ''' || T.col || ''''), --*!!!*--
        '//text()' ) AS col
    FROM  ABC.col T
    WHERE TABLE_OWNER = 'CC' AND TABLE_NAME = '8ca5S' --*****<<<*****--
    AND col like 'txtxt%'
    ORDER BY col
    ) A,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,col
    FROM  ABC.col
    WHERE TABLE_OWNER = 'CC' AND TABLE_NAME = '8ca5S' --*****<<<*****--
    AND (col like '%txtxt%')
    ) B,
    (
    SELECT  TABLE_OWNER,TABLE_NAME,...
    FROM  ABC.col
    WHERE TABLE_OWNER = 'CC' AND TABLE_NAME = '8ca5S' --*****<<<*****--
    GROUP BY TABLE_OWNER,TABLE_NAME
    ) C,
    (
        SELECT A.OWNER AS TABLE_OWNER,A.TABLE_NAME,...
        FROM
        (
                SELECT OWNER,NAME AS TABLE_NAME,COL_NAME AS col
                FROM xfile
                WHERE col = 'txtxt'
        ) A,
        (
                SELECT OWNER,TABLE_NAME,COL_NAME,...
                FROM xfile
        ) B
        WHERE A.OWNER = B.OWNER
          AND A.TABLE_NAME = B.TABLE_NAME
          AND ...
    ) D
    WHERE A.TABLE_OWNER = B.TABLE_OWNER(+)
      AND A.TABLE_NAME = B.TABLE_NAME(+)
      AND A.TABLE_OWNER = C.TABLE_OWNER(+)
      ...

)
    SELECT col
    FROM
    (
        SELECT '1' AS COL,'--/****** ' || col ||'.'|| col || '******/' AS col
        FROM xfile
        WHERE ROWNUM=1
        UNION ALL
        SELECT '2' AS COL,'--txtxt' FROM DUAL
        UNION ALL
        SELECT '3' AS COL,'txtxt' || col || '.' || col || 'txtxt < (' || 'txtxt' || ');' AS col --*!!!*--
        FROM xfile
        WHERE MAX_col NOT LIKE '%txtxt%'
        AND ROWNUM=1
        UNION ALL
        ...
    )
    ORDER BY col
)
UNION ALL
SELECT  CHR(123) || CHR(456) FROM DUAL
UNION ALL
SELECT  '--txtxt' FROM DUAL
UNION ALL
SELECT  'txtxt' || A.TABLE_OWNER || '.' || A.INDEX_NAME || 'txtxt' || ';' AS col --*!!!*--
FROM
(
SELECT A.TABLE_OWNER,A.INDEX_NAME,B.col,
CASE WHEN A.col IS NULL THEN B.col ELSE A.col END AS col
FROM ABC.col A, ABC.COL B
WHERE A.TABLE_OWNER=B.INDEX_OWNER(+) AND A.INDEX_NAME=B.INDEX_NAME(+)
AND A.OWNER = 'CC' AND A.TABLE_NAME = '8ca5S' --*****<<<*****--
AND B.col like 'txtxt%'
ORDER BY col
) A;